docs: update 3blue1brown demo PRD.
